In [1]:
import pandas as pd

In [4]:
revenues = pd.Series([5555, 7000, 1900])

In [5]:
revenues.index

RangeIndex(start=0, stop=3, step=1)

In [16]:
revenues.values

array([5555, 7000, 1900], dtype=int64)

In [21]:
city_revenues = pd.Series ([5500, 3300, 4400], ["Japan", "Amsterdam", "Jakarta"])
print(city_revenues)

Japan        5500
Amsterdam    3300
Jakarta      4400
dtype: int64

In [18]:
city_revenues = pd.Series ({"Japan":5500, "Amsterdam":3300, "Tokyo":4400})
print(city_revenues)

Japan        5500
Amsterdam    3300
Tokyo        4400
dtype: int64

In [22]:
city_employee_count = pd.Series({"Amsterdam": 5, "Tokyo": 8})
city_employee_count

Amsterdam    5
Tokyo        8
dtype: int64

In [19]:
city_revenues.keys()

Index(['Japan', 'Amsterdam', 'Tokyo'], dtype='object')

In [30]:
city_revenues.values

array([5500, 3300, 4400], dtype=int64)

In [25]:
city_data = pd.DataFrame({
    "revenue": city_revenues,
    "employee_count": city_employee_count})

In [26]:
city_data

           revenue  employee_count
Amsterdam   3300.0             5.0
Jakarta     4400.0             NaN
Japan       5500.0             NaN
Tokyo          NaN             8.0

In [27]:
#cek jenis data di data frame
city_data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Amsterdam to Tokyo
Data columns (total 2 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   revenue         3 non-null      float64
 1   employee_count  2 non-null      float64
dtypes: float64(2)
memory usage: 96.0+ bytes

In [28]:
#akses index di dataframe
city_data.index

Index(['Amsterdam', 'Jakarta', 'Japan', 'Tokyo'], dtype='object')

In [29]:
#akses values di dataframe
city_data.values

array([[3.3e+03, 5.0e+00],
       [4.4e+03,     nan],
       [5.5e+03,     nan],
       [    nan, 8.0e+00]])

In [31]:
#akses columns di dataframe
city_data.columns

Index(['revenue', 'employee_count'], dtype='object')

In [33]:
#akses axes
city_data.axes

[Index(['Amsterdam', 'Jakarta', 'Japan', 'Tokyo'], dtype='object'),
 Index(['revenue', 'employee_count'], dtype='object')]

In [36]:
city_data.axes[1]
#axes 0 berdasarkan baris
#axes 1 berdasar kan column

Index(['revenue', 'employee_count'], dtype='object')

In [37]:
city_data.keys()
#di dataframe yg keluar nama column

Index(['revenue', 'employee_count'], dtype='object')

In [38]:
"Japan" in city_data

False

In [40]:
"revenue" in city_data
#cek elemen hanya berlaku untuk column bukan indexdo data frame

True

Accessing Series Elements

In [41]:
city_revenues

Japan        5500
Amsterdam    3300
Jakarta      4400
dtype: int64

In [42]:
city_revenues ["Japan"]

5500

In [43]:
city_revenues[1]
#cuma ingin tau valuenya berapa

3300

In [45]:
city_revenues[1:]
#kalau cuma dapet valuenya aja tanpa index akan bingung,maka dikasih index

Amsterdam    3300
Jakarta      4400
dtype: int64

Using .loc and .iloc

SERIES

In [46]:
colors = pd.Series(
    ["red", "purple", "blue", "green", "yellow"],
    index=[1, 2, 3, 5, 8]
)

In [49]:
#colors.loc[1]
#.loc refers to the label index.
colors.loc[1:3]
#range akhir akan terikut

1       red
2    purple
3      blue
dtype: object

In [51]:
#colors.iloc[1]
#.iloc refers to the positional index.
colors.iloc[1:3]
#seperti index biasanya, yang range terakhir gaikut

2    purple
3      blue
dtype: object

In [52]:
colors.loc[[1,3,8]]

1       red
3      blue
8    yellow
dtype: object

In [53]:
colors.loc[1:8:2]
#range 1:8 dan longkap 2

1       red
3      blue
8    yellow
dtype: object

In [54]:
city_revenues

Japan        5500
Amsterdam    3300
Jakarta      4400
dtype: int64

In [57]:
city_revenues.loc["Amsterdam":]

Amsterdam    3300
Jakarta      4400
dtype: int64

DataFrame

In [58]:
city_data

           revenue  employee_count
Amsterdam   3300.0             5.0
Jakarta     4400.0             NaN
Japan       5500.0             NaN
Tokyo          NaN             8.0

In [61]:
#akses column di dataframe

#city_data["revenue"]\
city_data.revenue

#.column kelemahannya adalah kalau nama sama dengan atribut

Amsterdam    3300.0
Jakarta      4400.0
Japan        5500.0
Tokyo           NaN
Name: revenue, dtype: float64

In [64]:
toys = pd.DataFrame([
    {"name": "ball", "shape": "sphere"},
    {"name": "Rubik's cube", "shape": "cube"}
])

toys

           name   shape
0          ball  sphere
1  Rubik's cube    cube

In [63]:
toys["shape"]

0    sphere
1      cube
Name: shape, dtype: object

In [65]:
toys.shape
#kelemahan pake.column karena ada kesamaan antara

(2, 2)

In [66]:
city_data

           revenue  employee_count
Amsterdam   3300.0             5.0
Jakarta     4400.0             NaN
Japan       5500.0             NaN
Tokyo          NaN             8.0

In [81]:
city_data.loc["Amsterdam": "Japan", "revenue"]

Amsterdam    3300.0
Jakarta      4400.0
Japan        5500.0
Name: revenue, dtype: float64

In [78]:
city_data.iloc[1]

revenue           4400.0
employee_count       NaN
Name: Jakarta, dtype: float64

Aggregation Function

In [82]:
city_revenues

Japan        5500
Amsterdam    3300
Jakarta      4400
dtype: int64

In [83]:
city_revenues.sum()

13200

In [85]:
city_revenues.max()

5500

In [87]:
city_revenues.min()

3300

In [88]:
city_revenues.mean()

4400.0

Combining multiple data frame

In [89]:
further_city_data = pd.DataFrame(
    {"revenue": [7000, 3400], "employee_count": [2, 2]},
    index=["New York", "Barcelona"]
)

In [90]:
further_city_data

           revenue  employee_count
New York      7000               2
Barcelona     3400               2

In [91]:
city_data

           revenue  employee_count
Amsterdam   3300.0             5.0
Jakarta     4400.0             NaN
Japan       5500.0             NaN
Tokyo          NaN             8.0

In [95]:
all_city_data = pd.concat([city_data, further_city_data])
all_city_data

           revenue  employee_count
Amsterdam   3300.0             5.0
Jakarta     4400.0             NaN
Japan       5500.0             NaN
Tokyo          NaN             8.0
New York    7000.0             2.0
Barcelona   3400.0             2.0

In [97]:
not_all_city_data = pd.concat([city_data, further_city_data], sort=False)

In [98]:
not_all_city_data

           revenue  employee_count
Amsterdam   3300.0             5.0
Jakarta     4400.0             NaN
Japan       5500.0             NaN
Tokyo          NaN             8.0
New York    7000.0             2.0
Barcelona   3400.0             2.0

In [100]:
city_countries = pd.DataFrame({
    "country": ["Holland", "Japan", "Holland", "Canada", "Spain"],
    "capital": [1, 1, 0, 0, 0]},
    index=["Amsterdam", "Tokyo", "Rotterdam", "Toronto", "Barcelona"]
)
city_countries

           country  capital
Amsterdam  Holland        1
Tokyo        Japan        1
Rotterdam  Holland        0
Toronto     Canada        0
Barcelona    Spain        0

In [112]:
and_all_city_data = pd.concat([all_city_data, city_countries], axis=1, sort=False)
and_all_city_data

           revenue  employee_count  country  capital
Amsterdam   3300.0             5.0  Holland      1.0
Jakarta     4400.0             NaN      NaN      NaN
Japan       5500.0             NaN      NaN      NaN
Tokyo          NaN             8.0    Japan      1.0
New York    7000.0             2.0      NaN      NaN
Barcelona   3400.0             2.0    Spain      0.0
Rotterdam      NaN             NaN  Holland      0.0
Toronto        NaN             NaN   Canada      0.0

In [113]:
pd.concat([all_city_data, city_countries], axis=1, join="inner")

           revenue  employee_count  country  capital
Amsterdam   3300.0             5.0  Holland        1
Tokyo          NaN             8.0    Japan        1
Barcelona   3400.0             2.0    Spain        0

In [115]:
countries = pd.DataFrame({
    "population_millions": [17, 127, 37],
    "continent": ["Europe", "Asia", "North America"]
}, index=["Holland", "Japan", "Canada"])
countries

         population_millions      continent
Holland                   17         Europe
Japan                    127           Asia
Canada                    37  North America

In [116]:
further_city_data = pd.DataFrame(
    {"revenue": [7000, 3400], "employee_count": [2, 2]},
    index=["New York", "Barcelona"]
)

In [118]:
city_countries = pd.DataFrame({
    "country": ["Holland", "Japan", "Holland", "Canada", "Spain"],
    "capital": [1, 1, 0, 0, 0]},
    index=["Amsterdam", "Tokyo", "Rotterdam", "Toronto", "Barcelona"]
)
city_countries

           country  capital
Amsterdam  Holland        1
Tokyo        Japan        1
Rotterdam  Holland        0
Toronto     Canada        0
Barcelona    Spain        0

In [120]:
cities = pd.concat([all_city_data, city_countries], axis=1, sort=False)
cities

           revenue  employee_count  country  capital
Amsterdam   3300.0             5.0  Holland      1.0
Jakarta     4400.0             NaN      NaN      NaN
Japan       5500.0             NaN      NaN      NaN
Tokyo          NaN             8.0    Japan      1.0
New York    7000.0             2.0      NaN      NaN
Barcelona   3400.0             2.0    Spain      0.0
Rotterdam      NaN             NaN  Holland      0.0
Toronto        NaN             NaN   Canada      0.0

In [121]:
countries

         population_millions      continent
Holland                   17         Europe
Japan                    127           Asia
Canada                    37  North America

In [122]:
pd.merge(cities, countries, left_on="country", right_index=True)

,revenue,employee_count,country,capital,population_millions,continent
Amsterdam,3300.0,5.0,Holland,1.0,17,Europe
Rotterdam,NaN,NaN,Holland,0.0,17,Europe
Tokyo,NaN,8.0,Japan,1.0,127,Asia
Toronto,NaN,NaN,Canada,0.0,37,North America